let typed = new Typed('#typed-text', {
    strings: ['这是一个','给黄维依小姐写的网站','既然花了一个月来写，那就保留一个月吧','不晓得现在是几点了，外面是很荒诞的静寂。','好啦，我们说回正题！','生日快乐！','呼......','总有那么一瞬间，我以为我会失去你了。','我以为我能接受失去你了。','但我还是输给了思维宫殿的前庭，你早已顺着走廊跌撞着寻找我的开端。','  ','但这并不代表我只爱我自己，可现在只是清楚不应如何去行事，用一颗百年内要走向死亡的心脏跳动着，赞美你展现过的事物和普遍来看较为短暂的陪伴，还有三四年前的夏日，上一个秋天，还有这个要跨过的，已经死亡的春天。',' ','我拥有的·冲动一直是存在过的，这件事再也不会从现在正在看这个无聊的牢骚的女人身上移开半步，也再不能挪进一步。','如果你出现在我的身边，我也一定会痛哭失声，痛诉所见的不公，幻想期盼的末日。',' ','因此，我藉着这些还在我身上的事物，我有勇气说这就是我持有过的爱。','一个定义上广泛，表现形式复杂多变，无法轻易脱离出其他情感的知觉。','至少我暂时发现如此。','呼','我早就认知到，爱不过是荷尔蒙，神经递质，多巴胺这些化学物质共同作用的结果，甚至我的灵魂，也不过是血管里头微弱的生物电流的表现。',' ','但这并不能代表我爱上你没有意义，至少在生物学上，在你出现时，那些元素一股脑的作用在我的每个细胞中，它们选择了在那一刻注入我的器官，让我在爱上你的那个瞬间，心脏多跳了一下。',' ','但是没关系，在我荒诞地像个小孩子一般吵闹时，心也停了一下。',' ','扯平了。',' ','今天是，2023年，五月二十七号。','叶某于南京，很想你。'],
    typeSpeed: 100,
    backSpeed: 50,
    loop: true,
    showCursor: true,
    cursorChar: '|',
    smartBackspace: true,
    backDelay: 1000,
    startDelay: 1000
  });
  const audio = document.getElementById('audio');
const playButton = document.querySelector('.play-button');

function toggleAudio() {
  if (audio.paused) {
    audio.play();
    playButton.classList.add('audio-playing');
  } else {
    audio.pause();
    playButton.classList.remove('audio-playing');
  }
}
